app/controllers/user_sessions_controller.rb

SELECT `user_sessions`.* FROM `user_sessions` WHERE `user_sessions`.`email` IS NULL
---
  def create
  	@user_session = UserSession.new( params[:user_session] )
  	if UserSession.where( :email => params[:email] )