app/controllers/users_controller.rb

INSERT INTO `users` (`confirm_password`, `country`, `created_at`, `email`, `first_name`, `last_name`, `password`, `updated_at`) VALUES ('net..com', NULL, '2012-08-09 19:14:36', 'msaad_msn@hotmail.com', 'Muhammad', 'Saad', 'net..com', '2012-08-09 19:14:36')
---
	def create
		@user = User.new( params[:user] )

		if @user.save