app/controllers/user_sessions_controller.rb

INSERT INTO `user_sessions` (`created_at`, `email`, `password`, `remember_me`, `updated_at`) VALUES ('2012-08-05 03:09:38', '', '', 0, '2012-08-05 03:09:38')
---
  def create
  	@user_session = UserSession.new( params[:user_session] )

  	if @user_session.save